tutorials/multiphase/waves/waveDyMSolver/waveFlume/0/pointDisplacement
/*---------------------------------------------------------------------------*\
 Caelus 7.04                                   
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    atmosphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontBack
    {
        type            empty;
    }
    floatingObject
    {
        type            fixedValue;
        value           uniform (6.92368e-310 6.92368e-310 1.85396e-316);
    }
}


// ************************************************************************* //
